import numpy as np

def toCelsius( f ): 
    # f เป็นอาเรย์หนึ่งมิติเก็บอุณหภูมิในหน่วยองศาฟาเรนไฮต์
    # คืนอาเรย์หนึ่งมิติที่เก็บอุณหภูมิในหน่วยองศาเซลเซยีสทได้จากการแปลงแต่ละอุณหภูมิใน f
    return 5 * (f - 32) / 9

def BMI( wh ):
    # wh เป็นอาเรย์สองมิติขนาด n^2 แทนน้ำหนัก (หน่วยเป็น กก.) และความสูง (หน่วยเป็น ซม.)
    # ของคน n คน คอลัมน์ 0 เก็บน้ำหนัก คอลัมน์ 1 เก็บความสูง [[w1,h1], [w2,h2], ...]
    # คืนอาเรย์หนึ่งมิติที่เก็บค่า body mass index ของทุกคนใน wh
    return wh[::, 0] / ((wh[::, 1] / 100) ** 2)
 
def distanceTo( p, Points ):
    # p เป็นอาเรย์หนึ่งมิติขนาด 2 ชองแทนจุดหนึ่งจุดช่อง 0 เก็บพิกัด x ช่อง 1 เก็บพิกัด y
    # Points เป็นอาเรย์สองมิติขนาด n^2 เก็บพิกัดของจุดจำนวน n จุด
    # คืนอาเรย์หนึ่งมิต n ช่อง ที่เก็บระยะทางที่วัดจากจุด p ถึงแต่ละจุดใน Points
    return np.sqrt((p[0] - Points[::, 0]) ** 2 + (p[1] - Points[::, 1]) ** 2)

exec(input().strip()) # ต้องมีคำสั่งนี้ ตรงนี้ตอนส่งให้ Grader ตรวจ