import numpy as np

def read_data():
    # อ่านข้อมูลจากแป้นพิมพ์ จากนั้นสร้างและคืนอาเรย์สองตัว
    # weight เป็นอาเรย์สามช่องเก็บน้ำหนักของคะแนนกลางภาค ปลายภาค และโครงงาน (float)
    # data เป็นอาเรย์ขนาด n^4 เก็บข้อมูลนักเรียน n คน แต่ละคนมีข้อมูล
    # เลขประจำตัว คะแนนกลางภาค ปลายภาค และโครงงาน (int)
    w = [float(e) for e in input().split()]
    weight = np.array(w)
    n = int(input())
    data = np.ndarray((n, 4), int)
    for i in range(n):
        data[i] = [int(e) for e in input().split()]
    return weight, data
 
def report_lower_than_mean(weight, data):
    # แสดงเลขประจำตัวที่ได้คะแนนรวมต่ำกว่าคะแนนเฉลี่ย
    # - คะแนนรวม คำนวณมาจากผลรวมของ คะแนนแต่ละส่วนคูณด้วยน้ำหนักของแต่ละส่วน
    # - คะแนนเฉลี่ย คือค่าเฉลี่ยของคะแนนรวมต่าง ๆ
    # ให้แสดงบนบรรทัดเดียวกันหมดคั่นดว้ยเครื่องหมายจุลภาคและช่องว่างหนึ่งช่อง
    # เรียงตามลำดับที่ปรากฎใน data ถ้าไม่มีใครได้ต่ำกว่าคะแนนเฉลี่ยเลย ให้แสดงคำว่า None
    mean = np.mean(np.sum(data[:, 1:], axis = 1))
    c = data[np.sum(data[:, 1:]) > mean]
    print(c)

exec(input().strip()) # ต้องมีคำสั่งนี้ ตรงนี้ ตอนส่งให้ Grader ตรวจ